In [104]:
import pandas as pd
import numpy as np
import matplotlib
import matplotlib.pyplot as plt
from matplotlib.path import Path
import geopandas as gpd
import pdpipe as pdp
from shapely.geometry import Point, Polygon, MultiPolygon
from shapely import wkt
from random import *

In [3]:
nyc_name = "Data/nyc_bikeshare"

original_nyc = pd.read_csv(nyc_name+".csv")
nyc = original_nyc
nyc.head()

,tripduration,starttime,stoptime,start_station_id,end_station_id,bikeid,usertype,birthyear,gender
0,2059,06-01-13 00:00:44,06-01-13 00:35:03,406.0,406.0,19599,0.0,NaN,0
1,1521,06-01-13 00:01:22,06-01-13 00:26:43,2008.0,310.0,15567,1.0,1983.0,1
2,2028,06-01-13 00:01:47,06-01-13 00:35:35,485.0,406.0,18445,0.0,NaN,0
3,1829,06-01-13 00:03:47,06-01-13 00:34:16,265.0,436.0,15234,1.0,1984.0,1
4,899,06-01-13 00:09:25,06-01-13 00:24:24,494.0,494.0,15539,1.0,1967.0,1

In [4]:
nyc_sub = nyc.sample(272000)

In [5]:
pipe = pdp.ColDrop("bikeid")
pipe += pdp.DropNa(subset=["start_station_id","end_station_id","tripduration"])
pipe += pdp.RowDrop({"tripduration": lambda t : t<60})

nyc_sub = pipe(nyc_sub)
nyc_sub.head()

,tripduration,starttime,stoptime,start_station_id,end_station_id,usertype,birthyear,gender
21679149,299,01-23-19 19:49:23,01-23-19 19:54:23,432.0,266.0,1.0,1991.0,1
9972891,3733,09-11-16 15:59:59,09-11-16 17:02:12,457.0,469.0,0.0,NaN,0
4105739,628,12-29-14 14:29:28,12-29-14 14:39:56,153.0,468.0,1.0,1959.0,1
9909812,594,09-07-16 19:10:26,09-07-16 19:20:20,326.0,537.0,1.0,1978.0,2
15688970,199,11-05-17 11:07:48,11-05-17 11:11:07,3061.0,3064.0,1.0,1990.0,1

In [6]:
nyc_name_key = "Data/legend/nyc_bikeshare_key"

original_nyc_key = pd.read_csv(nyc_name_key+".csv")
nyc_key = original_nyc_key
nyc_key.head()

,station_id,station_name,station_latitude,station_longitude
0,72,W 52 St & 11 Ave,40.767272,-73.993929
1,79,Franklin St & W Broadway,40.719116,-74.006667
2,82,St James Pl & Pearl St,40.711174,-74.000165
3,83,Atlantic Ave & Fort Greene Pl,40.683826,-73.976323
4,116,W 17 St & 8 Ave,40.741776,-74.001497

In [7]:
nyc_key.set_index("station_id", inplace=True)

pipe_key = pdp.ColDrop("station_name")

nyc_key = pipe_key(nyc_key)
nyc_key.head()

            station_latitude  station_longitude
station_id
72                 40.767272         -73.993929
79                 40.719116         -74.006667
82                 40.711174         -74.000165
83                 40.683826         -73.976323
116                40.741776         -74.001497

In [8]:
boston_name = "Data/boston_bikeshare"

original_boston = pd.read_csv(boston_name+".csv")
boston = original_boston
boston.head()

,tripduration,starttime,stoptime,start_station_id,end_station_id,bikeid,usertype,birthyear,gender
0,1712,11-30-11 23:58:00,12-01-11 00:26:00,D32005,D32011,B00056,1,NaN,1
1,313,11-30-11 23:56:00,12-01-11 00:01:00,C32008,D32011,B00133,0,NaN,0
2,1111,11-30-11 23:18:00,11-30-11 23:36:00,A32009,D32006,B00471,1,NaN,1
3,1313,11-30-11 23:15:00,11-30-11 23:37:00,A32001,D32005,B00056,1,NaN,1
4,345,11-30-11 22:59:00,11-30-11 23:05:00,B32008,D32006,B00174,1,NaN,1

In [9]:
boston_sub = boston.sample(100000)

In [10]:
boston_sub = pipe(boston_sub)
boston_sub.head()

,tripduration,starttime,stoptime,start_station_id,end_station_id,usertype,birthyear,gender
10018364,756,09-21-19 14:19:47,09-21-19 14:32:23,B32020,D32042,1,1998.0,1
904487,503,09-27-13 18:02:00,09-27-13 18:10:00,M32021,M32014,1,NaN,1
8676678,421,05-09-19 07:46:05,05-09-19 07:53:07,M32010,C32010,1,1987.0,2
1620680,169,06-23-14 17:13:00,06-23-14 17:16:00,D32008,D32006,1,NaN,1
6809175,933,05-20-18 18:18:25,05-20-18 18:33:58,B32023,B32013,1,1952.0,1

In [11]:
boston_name_key = "Data/legend/boston_bikeshare_key"

original_boston_key = pd.read_csv(boston_name_key+".csv")
boston_key = original_boston_key

boston_key.set_index("station_id", inplace=True)

boston_key = pipe_key(boston_key)

boston_key_pipe = pdp.ColDrop("total_docks")
boston_key_pipe += pdp.RowDrop({"status": lambda s: s!="Active"})

boston_key = boston_key_pipe(boston_key)
boston_key.head()

            station_latitude  station_longitude district  status
station_id
A32000             42.353391         -71.044571   Boston  Active
A32001             42.353334         -71.137313   Boston  Active
A32002             42.351692         -71.119035   Boston  Active
A32003             42.350406         -71.108279   Boston  Active
A32004             42.338629         -71.106500   Boston  Active

In [12]:
nyc_sub.to_csv("nyc_bikeshare_sub.csv")
boston_sub.to_csv("boston_bikeshare_sub.csv")

In [127]:
nyc_sub = nyc_sub[nyc_sub.start_station_id != nyc_sub.end_station_id]
boston_sub = boston_sub[boston_sub.start_station_id != boston_sub.end_station_id]